//=============================================================================

// function App() {
//   return (
//     <div>
//       <h1>React 시작하기</h1>
//     </div>
//   );
// }

//=============================================================================

// function App() {
//   const name = "지훈";

//   return <h1>안녕하세요 {name}</h1>;
// }

//=============================================================================

// function App()  {
//   return (
//     <div>
//       <h1>오늘의 메뉴</h1>
//       <p>김치볶음밥</p>
//     </div>
//   );
// }

//=============================================================================

// function App()  {
//   return (
//     <div>
//       <img src="dog.jpg" width={150} alt="강아지"/>
//     </div>
//   );
// }

//=============================================================================

// function App()  {
//   return (
//     <div className="card">
//       <h2>프로필</h2>
//       <p>프런트엔드 개발자</p>
//     </div>
//   );
// }

//=============================================================================

// function App() {
//   const food = "치킨";
//   const price = 20000;

//   return <h1>{food} 가격은 {price}원 입니다.</h1>;
// }

//=============================================================================

// function App() {
//   return (
//     <div>
//       <h1>내 취미</h1>
//       <ul>
//         <li>게임</li>
//         <li>영화</li>
//         <li>운동</li>
//       </ul>
//     </div>
//   );
// }

//=============================================================================

// function App() {
//   return (
//     <div>
//       <p style={{color:"blue", fontSize:"24px"}}>스타일 적용 연습</p>
//     </div>
//   );
// }

//=============================================================================

// function App() {
  
//   const name = "김도형";
//   const age = 21;
//   const hob = "여행";
//   return (
//     <div>
//       <h1>이름 : {name}</h1>
//       <p>나이 : {age}</p>
//       <p>취미 : {hob}</p>
//     </div>
//   );
// }

//=============================================================================

function App() {
  
  const name = "김도형";
  const age = 24;
  const major = "컴퓨터 공학";
  return (
    <div style={{
      border:"1px solid gray",
      padding:"20px",
      width:"250px",
      backgroundColor:"yellow"
    }}>
      <h1 style={{color:"blue"}}>프로필</h1>
      <div style={{color:"black"}}>
        <p>이름 : {name}</p>
        <p>나이 : {age}</p>
        <p>전공 : {major}</p>
      </div>
      
      <br/>
      <h2 style={{color:"blue"}}>좋아하는 것</h2>
        <div style={{color:"black"}}>
          <ul>
            <li>게임</li>
            <li>영화</li>
            <li>운동</li>
          </ul>
        </div>
        
    </div>
  );
}

export default App
